Tekla Open API Reference for Tekla Structures 2025
Task.Completeness Property
 The percentage of the completeness of the task on the scale from 0 to 100.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Completeness { get; set; }
Public Property Completeness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Task Class
Tekla.Structures.Model Namespace